Revit 2024 API
ParameterTypeId.AnalyticalModelCodeChecking Property
 "Code Checking": Used for Analytical wall, Analytical beam, Analytical column, Analytical floor, Analytical wall foundations, Analytical isolated foundations, Analytical foundations slab, Anaytical brace
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId AnalyticalModelCodeChecking { get; }
Visual Basic
Public Shared ReadOnly Property AnalyticalModelCodeChecking As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ AnalyticalModelCodeChecking {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace